In [1]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.27-cp38-cp38-win_amd64.whl (7.7 MB)
Collecting protobuf>=3.0.0
  Downloading protobuf-3.19.1-cp38-cp38-win_amd64.whl (895 kB)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.27 protobuf-3.19.1
Note: you may need to restart the kernel to use updated packages.

In [7]:
from mysqldb_python import CreateTable

In [5]:
conn=CreateTable()
conn.connectToDB("localhost","manidhar","manidhar")
print(conn.showDatases())
# create table
conn.createTable("manidhar","employee","emp_id int(10) primary key,emp_name varchar(20),emp_salary int(10)")
# insert data
conn.insertData("manidhar","employee","emp_id,emp_name,emp_salary","1,'Nagaraju',2500000")
conn.insertData("manidhar","employee","emp_id,emp_name,emp_salary","2,'Swaroop',2000000")
conn.insertData("manidhar","employee","emp_id,emp_name,emp_salary","3,'Manidhar',1800000")
# fetch data
print(conn.fetchData("manidhar","employee","emp_id,emp_name,emp_salary","emp_id=1"))
conn.closeConnection()

<mysql.connector.connection.MySQLConnection object at 0x000001D52F80F160>
('eastface_eastface',)
('information_schema',)
('manidhar',)
('mysql',)
('mytestdb',)
('mytestdb1',)
('performance_schema',)
('sakila',)
('student',)
('sys',)
('vaddidb',)
('world',)
None
Error inserting data :  1062 (23000): Duplicate entry '1' for key 'employee.PRIMARY'
Error inserting data :  1062 (23000): Duplicate entry '2' for key 'employee.PRIMARY'
[(1, 'Nagaraju', 2500000)]

In [15]:
import pandas as pd
conn1=CreateTable()
conn1.connectToDB("localhost","manidhar","manidhar")
df=pd.read_sql_query("select * from manidhar.employee",conn1.mysqldb)
df1=pd.read_sql("select * from manidhar.employee",conn1.mysqldb)
conn1.closeConnection()
print(df)
df1

   emp_id  emp_name  emp_salary
0       1  Nagaraju     2500000
1       2   Swaroop     2000000
2       3  Manidhar     1800000

   emp_id  emp_name  emp_salary
0       1  Nagaraju     2500000
1       2   Swaroop     2000000
2       3  Manidhar     1800000